Repository: Joel-Fah/busin
Catalog: lib/l10n/app_*.arb
Languages: fr

# subscriptionTab_emptyState_ctaLabel
source: Subscribe now for
fr: Abonnez-vous maintenant pour

# subscriptionTab_activeCta_message
source: You don't have any subscription running currently. Maybe, subscribe now to the bus services for the ongoing semester
fr: Vous n'avez actuellement aucun abonnement. Vous pourriez vous abonner dès maintenant aux services de bus pour le semestre en cours.

# subscriptionTab_emptyList_message
source: No other subscriptions yet.
fr: Aucun autre abonnement pour le moment.

# subscriptionTab_emptyList_messageFilter
source: No {status} subscriptions match the filter.
fr: Aucun abonnement {status} ne correspond au filtre.

# subscriptionTab_emptyState_supertitle
source: Seems like it’s your first time around
fr: On dirait que c'est votre première fois ici

# subscriptionTab_emptyState_title
source: You don’t have any subscriptions yet
fr: Vous n'avez pas encore d'abonnement

# subscriptionTab_emptyState_subtitle
source: Let’s get you started with a bus subscription so you can ride this semester.
fr: Commençons par un abonnement de bus pour que vous puissiez voyager ce semestre.

# scanningsTab_screenshotsWarning
source: Hey! Screenshots aren't allowed here to keep your QR code safe
fr: Attention ! Les captures d'écran ne sont pas autorisées ici afin de protéger votre code QR.

# subscriptionDetailPage_appBar_title
source: Subscription Details
fr: Détails de l'abonnement

# subscriptionDetailPage_nullContent_title
source: Subscription not found
fr: Abonnement introuvable

# subscriptionDetailPage_nullContent_message
source: The subscription you are looking for does not exist or has been removed.
fr: L'abonnement que vous recherchez n'existe pas ou a été supprimé.

# subscriptionDetailPage_handleRefresh_error
source: Failed to refresh:
fr: Échec de l'actualisation :

# subscriptionDetailPage_handleApprove_success
source: Subscription approved
fr: Abonnement approuvé

# subscriptionDetailPage_handleApprove_error
source: Failed to approve subscription:
fr: Échec de l'approbation de l'abonnement:

# subscriptionDetailPage_handleReject_success
source: Subscription rejected
fr: Abonnement refusé :

# subscriptionDetailPage_handleReject_error
source: Failed to reject subscription:
fr: Échec du refus de l'abonnement:

# subscriptionDetailPage_rejectDialog_title
source: Reject Subscription
fr: Refuser l'abonnement

# subscriptionDetailPage_rejectDialog_instruction
source: Please provide a reason for rejecting this subscription. This will be shown to the student.
fr: Veuillez indiquer le motif du refus de cet abonnement. Ce motif sera affiché à l'étudiant.

# subscriptionDetailPage_rejectDialog_reasonLabel
source: Rejection Reason
fr: Motif du refus

# subscriptionDetailPage_rejectDialog_reasonValidatorEmpty
source: Please provide a reason for rejection
fr: Veuillez indiquer le motif du refus

# subscriptionDetailPage_rejectDialog_reasonValidatorLength
source: Reason must be at least 10 characters long
fr: Le motif doit comporter au moins 10 caractères

# subscriptionDetailPage_rejectDialog_ctaReject
source: Reject Subscription
fr: Refuser l'abonnement

# subscriptionDetailPage_reviewInfo_sectionTitle
source: Review Information
fr: Informations de révision

# subscriptionDetailPage_reviewInfo_reviewedOn
source: Reviewed on
fr: Révisé le

# subscriptionDetailPage_reviewInfo_reviewedBy
source: Reviewed by
fr: Révisé par

# subscriptionDetailPage_statusDates_startLabel
source: Start Date
fr: Date de début

# subscriptionDetailPage_statusDates_endLabel
source: End Date
fr: Date de fin

# subscriptionDetailPage_statusDates_durationLabel
source: Time remaining
fr: Temps restant

# subscriptionDetailPage_weeklySchedule_title
source: Weekly Schedule
fr: Planning hebdomadaire

# subscriptionDetailPage_adminAction_approve
source: Approve
fr: Approuver

# subscriptionDetailPage_adminAction_reject
source: Reject
fr: Refuser

# subscriptionDetailPage_paymentProof_placeholder
source: No proof of payment
fr: Aucune preuve de paiement

# subscriptionDetailPage_statusLabel_approved
source: Subscription Approved
fr: Abonnement approuvé

# subscriptionDetailPage_statusLabel_pending
source: Pending Validation
fr: Validation en attente

# subscriptionDetailPage_statusLabel_rejected
source: Rejected Subscription
fr: Abonnement refusé

# subscriptionDetailPage_statusLabel_expired
source: Expired Subscription
fr: Abonnement expiré

# subscriptionDetailPage_mapView_title
source: Bus stop
fr: Arrêt bus

# subscriptionDetailPage_mapView_openMessageSuccess
source: Opened in Google Maps
fr: Ouvert dans Google Maps

# subscriptionDetailPage_mapView_openMessageError
source: Could not open Google Maps
fr: Impossible d'ouvrir Google Maps

# subscriptionDetailPage_mapView_ctaLabel
source: Tap to open on Google Maps
fr: Appuyez pour ouvrir dans Google Maps

# subscriptionDetailPage_mapView_ctaTooltip
source: Open in Google Maps
fr: Ouvrir dans Google Maps

# subscriptionDetailPage_mapView_pickupImageUnavailable
source: Image not available
fr: Image non disponible

# subscriptionDetailPage_mapView_pickupImagePreview
source: Pickup point preview
fr: Aperçu du point de retrait

# subscriptionDetailPage_studentSection_title
source: Student Information
fr: Informations sur l'étudiant

# subscriptionDetailPage_studentSection_loadingError
source: Failed to load student information
fr: Échec du chargement des informations de l'étudiant

# subscriptionDetailPage_studentSection_subtitle
source: Subscriber details
fr: Détails de l'abonné

# subscriptionDetailPage_studentSection_name
source: Name
fr: Nom

# subscriptionDetailPage_studentSection_email
source: Email
fr: Adresse e-mail

# subscriptionDetailPage_studentSection_status
source: Status
fr: Statut

# subscriptionDetailPage_studentSection_phone
source: Phone Number
fr: Numéro de téléphone

# peopleTab_appBar_title
source: People
fr: Personnes

# peopleTab_loadingState
source: Loading users...
fr: Chargement des utilisateurs...

# peopleTab_loadError
source: Error loading users
fr: Erreur lors du chargement des utilisateurs

# peopleTab_loadError_unknown
source: Unknown error
fr: Erreur inconnue

# peopleTab_emptyStudents_title
source: No Students Yet
fr: Aucun étudiant pour le moment

# peopleTab_emptyStaff_title
source: No Staff Yet
fr: Aucun membre du personnel pour le moment

# peopleTab_emptyStudents_subtitle
source: There are no students registered yet
fr: Aucun étudiant inscrit pour le moment

# peopleTab_emptyStaff_subtitle
source: There are no staff members registered yet
fr: Aucun membre du personnel inscrit pour le moment

# peopleTab_handleApprove_success
source: has been approved!
fr: a été approuvé !

# peopleTab_handleApprove_error
source: Failed to approve user:
fr: Échec de l'approbation de l'utilisateur :

# peopleTab_handleReject_success
source: has been rejected!
fr: a été rejeté !

# peopleTab_handleReject_error
source: Failed to reject user:
fr: Échec du refus de l'utilisateur :

# subscriptionAdminTab_searchHint
source: Search subscriptions...
fr: Rechercher les abonnements...

# subscriptionAdminTab_subsList_pending
source: Pending Review
fr: En attente de validation

# subscriptionAdminTab_subsList_emptyCard
source: No pending subscriptions
fr: Aucun abonnement en attente

# subscriptionAdminTab_filterMenu_title
source: Filter Subscriptions
fr: Filtrer les abonnements

# subscriptionAdminTab_filterMenu_ctaLabel
source: Clear Filters
fr: Effacer les filtres

# subscriptionAdminTab_approveSub_exception
source: User not authenticated
fr: Utilisateur non authentifié

# subscriptionAdminTab_errorWidget_message
source: Error loading subscriptions
fr: Erreur lors du chargement des abonnements

# subscriptionAdminTab_emptyWidget_title
source: No subscriptions yet
fr: Aucun abonnement pour le moment

# subscriptionAdminTab_emptyWidget_searchTitle
source: No subscriptions found
fr: Aucun abonnement trouvé

# subscriptionAdminTab_emptyWidget_subtitle
source: Subscriptions will appear here
fr: Les abonnements apparaîtront ici

# subscriptionAdminTab_emptyWidget_searchSubtitle
source: Try adjusting your filters
fr: Essayez d'ajuster vos filtres

# scannerPage_viewArea_pausedTitle
source: Scanner paused
fr: Scanner en pause

# scannerPage_infoBubble
source: Scan student QR codes
fr: Scanner les codes QR des étudiants

# scannerPage_controls_toggleFlash
source: Toggle flash
fr: Basculer le flash

# scannerPage_controls_pauseScanner
source: Pause scanner
fr: Mettre le scanner en pause

# scannerPage_controls_resumeScanner
source: Resume scanner
fr: Reprendre le scanner

# scannerPage_controls_resetScanner
source: Reset scanner
fr: Réinitialiser le scanner

# scannerPage_idleState_title
source: Ready to scan
fr: Prêt à scanner

# scannerPage_idleState_subtitle
source: Point the camera at a student's QR code to verify their bus access
fr: Pointez la caméra vers le code QR d'un élève pour vérifier son accès au bus

# scannerPage_progressingState_title
source: Verifying...
fr: Vérification en cours...

# scannerPage_progressingState_wait
source: Please wait
fr: Veuillez patienter

# scannerPage_resultState_statusGranted
source: ACCESS GRANTED
fr: ACCÈS AUTORISÉ

# scannerPage_resultState_statusDenied
source: ACCESS DENIED
fr: ACCÈS REFUSÉ

# scannerPage_resultState_errorUnknown
source: Unknown error
fr: Erreur inconnue

# scannerPage_resultState_ctaLabel
source: Next Scan
fr: Numérisation suivante

# scannerPage_compactInfo_email
source: Email
fr: Courriel

# scannerPage_compactInfo_subscription
source: Subscription
fr: Abonnement

# scannerPage_compactInfo_busStop
source: Bus Stop
fr: Arrêt de bus

# scannerPage_compactInfo_validity
source: Valid Until
fr: Valide jusqu'au

# scannerPage_compactInfo_emptySub
source: No active subscription found
fr: Aucun abonnement actif trouvé

# scannerPage_errorCard_title
source: Error
fr: Erreur

# analyticsTab_appBar_title
source: Analytics Dashboard
fr: Tableau de bord analytique

# analyticsTab_appBar_actionNumView
source: Numerical View
fr: Vue numérique

# analyticsTab_appBar_actionGraphView
source: Graphical View
fr: Vue graphique

# analyticsTab_loadingError
source: Failed to load analytics data
fr: Échec du chargement des données analytiques

# analyticsTab_subStatusSection_title
source: Subscription Status Overview
fr: Aperçu du statut d'abonnement

# analyticsTab_subStatusSection_subtitle
source: Current distribution of subscription statuses
fr: Répartition actuelle des statuts d'abonnement

# analyticsTab_subStatusSection_pendingReview
source: Pending Review
fr: En attente d'examen

# analyticsTab_subStatusSection_approvalRate
source: Approval Rate:
fr: Taux d'approbation :

# analyticsTab_emptyData
source: No data available
fr: Aucune donnée disponible

# analyticsTab_semesterSection_title
source: Semester Analytics
fr: Analyse semestrielle

# analyticsTab_semesterSection_chartTitle
source: Subscriptions by Semester
fr: Abonnements par semestre

# analyticsTab_semesterSection_subtitle
source: Subscriptions per semester this year
fr: Abonnements par semestre cette année

# analyticsTab_semesterSection_empty
source: No semester data available for
fr: Données semestrielles indisponibles pour

# analyticsTab_subByYear_title
source: Subscriptions by Year
fr: Abonnements par année

# analyticsTab_recentActivitySection_title
source: Recent Subscriptions
fr: Abonnements récents

# analyticsTab_recentActivitySection_subtitle
source: Last 10 submissions
fr: 10 dernières soumissions

# analyticsTab_recentActivitySection_noData
source: No recent subscription
fr: Aucun abonnement récent

# analyticsTab_topBusStopsSection_title
source: Most Popular Bus Stops
fr: Arrêts de bus les plus populaires

# analyticsTab_topBusStopsSection_subtitle
source: Top 5 by subscription count
fr: Top 5 par nombre d'abonnements

# analyticsTab_topBusStopsSection_ctaLabel
source: Manage stops
fr: Gérer les arrêts

# analyticsTab_topBusStopsSection_noData
source: No bus stop data available
fr: Données d'arrêts de bus indisponibles

# analyticsTab_quickActionsSection_title
source: Quick Actions
fr: Actions rapides

# analyticsTab_quickActionsSection_subtitle
source: Manage your system efficiently
fr: Gérez votre système efficacement

# analyticsTab_quickActionsSection_subscriptions
source: Review Subscriptions
fr: Consulter les abonnements

# analyticsTab_quickActionsSection_subscriptionsSubtitle
source: Approve or reject pending subscriptions
fr: Approuver ou refuser les abonnements en attente

# analyticsTab_quickActionsSection_busStops
source: Manage Bus Stops
fr: Gérer les arrêts de bus

# analyticsTab_quickActionsSection_busStopsSubtitle
source: Add, edit, or remove bus stops
fr: Ajouter, modifier ou supprimer des arrêts de bus

# analyticsTab_quickActionsSection_semesters
source: Manage Semesters
fr: Gérer les semestres

# analyticsTab_quickActionsSection_semestersSubtitle
source: Configure semester dates and settings
fr: Configurer les dates et les paramètres des semestres

# newSubscriptionPage_scheduleTime_earlyError
source: Earliest morning time is 6:30 AM.
fr: Le premier créneau disponible le matin est 6h30.

# newSubscriptionPage_scheduleTime_morningError
source: Morning time must be <= closing time..
fr: L'heure du matin doit être inférieure ou égale à l'heure de fermeture.

# newSubscriptionPage_scheduleTime_latestError
source: Latest close time is 5:00 PM.
fr: L'heure de fermeture la plus tardive est 17h00.

# newSubscriptionPage_scheduleTime_closingError
source: Close time must be >= morning time.
fr: L'heure de fermeture doit être supérieure ou égale à l'heure du matin.

# newSubscriptionPage_validateStep_proofUpload
source: Please upload a proof of payment to proceed.
fr: Veuillez télécharger une preuve de paiement pour continuer.

# newSubscriptionPage_validateStep_semester
source: Please wait for active semester to load or contact administrator.
fr: Veuillez patienter pendant le chargement du semestre actif ou contacter l'administrateur.

# newSubscriptionPage_validateStep_stop
source: Select a preferred stop to proceed.
fr: Sélectionnez un arrêt pour continuer.

# newSubscriptionPage_validateStep_schedule
source: Add at least one schedule.
fr: Ajoutez au moins un horaire.

# newSubscriptionPage_validateStep_scheduleInvalid
source: One or more schedule times are invalid.
fr: Une ou plusieurs heures de planification sont invalides.

# newSubscriptionPage_submit_validateSteps
source: Fill out every step before submitting.
fr: Veuillez remplir chaque étape avant de soumettre.

# newSubscriptionPage_submit_validateStop
source: Unable to resolve selected stop.
fr: Impossible de résoudre l'étape sélectionnée.

# newSubscriptionPage_validateStep_proofUploadException
source: Proof file not found. Please re-upload.
fr: Fichier de preuve introuvable. Veuillez le télécharger à nouveau.

# newSubscriptionPage_validateStep_proofUploadMessage
source: Unable to upload proof:
fr: Impossible de télécharger la preuve :

# newSubscriptionPage_submit_success
source: Subscription created (pending review)
fr: Abonnement créé (en attente de validation)

# newSubscriptionPage_submit_failed
source: Failed to submit subscription:
fr: Échec de la soumission de l'abonnement :

# newSubscriptionPage_appBar_title
source: New Subscription
fr: Nouvel abonnement

# newSubscriptionPage_semesterStep_refreshSuccess
source: Semesters refreshed
fr: Semestres actualisés

# newSubscriptionPage_stopStep_refreshSuccess
source: Stops refreshed
fr: Abonnements actualisés

# newSubscriptionPage_semesterStep_refresh
source: Refresh Semesters
fr: Actualiser les semestres

# newSubscriptionPage_stopStep_refresh
source: Refresh Stops
fr: Actualiser les abonnements

# newSubscriptionPage_proofStep_title
source: Receipt
fr: Reçu

# newSubscriptionPage_proofStep_subtitle
source: Proof of payment
fr: Preuve de paiement

# newSubscriptionPage_proofStep_imageBox
source: Upload a copy of your receipt
fr: Télécharger une copie de votre reçu

# newSubscriptionPage_semesterStep_emptyActive
source: No active semester available. Please contact the administrator.
fr: Aucun semestre actif disponible. Veuillez contacter l'administrateur.

# newSubscriptionPage_semesterStep_activeSemester
source: Active semester
fr: Semestre actif

# newSubscriptionPage_semesterStep_infoBubble
source: Your subscription will be valid for the active semester shown above.
fr: Votre abonnement sera valable pour le semestre actif indiqué ci-dessus.

# newSubscriptionPage_stopStep_title
source: Preferred stop
fr: Arrêt préféré

# newSubscriptionPage_stopStep_validatorEmpty
source: Select a bus stop.
fr: Sélectionnez un arrêt de bus.

# newSubscriptionPage_stopStep_label
source: Select stop
fr: Sélectionnez un arrêt

# newSubscriptionPage_scheduleStep_title
source: Weekly schedules
fr: Horaires hebdomadaires

# newSubscriptionPage_scheduleStep_optionEveryday
source: Everyday
fr: Tous les jours

# newSubscriptionPage_scheduleStep_optionNormal
source: Normal week
fr: Semaine normale

# newSubscriptionPage_scheduleStep_optionCustom
source: Custom
fr: Personnalisé

# newSubscriptionPage_scheduleStep_empty
source: No schedules added. Add the days you take the bus.
fr: Aucun horaire ajouté. Ajoutez les jours où vous prenez le bus.

# newSubscriptionPage_scheduleStep_maxReached
source: Maximum of 6 days reached (Mon - Sat).
fr: Maximum de 6 jours atteint (lun. - sam.).

# newSubscriptionPage_reviewStep_title
source: Review & Submit
fr: Vérifier et soumettre

# newSubscriptionPage_reviewStep_subtitle
source: Review Your Subscription Details
fr: Vérifiez les détails de votre abonnement

# newSubscriptionPage_reviewStep_description
source: Please verify all details before submitting
fr: Veuillez vérifier tous les détails avant de soumettre

# newSubscriptionPage_reviewStep_studentInfo
source: Student Information
fr: Informations sur l'étudiant

# newSubscriptionPage_reviewStep_studentName
source: Name
fr: Nom

# newSubscriptionPage_reviewStep_studentEmail
source: Email
fr: Adresse e-mail

# newSubscriptionPage_reviewStep_semesterDetails
source: Semester Details
fr: Détails du semestre

# newSubscriptionPage_reviewStep_semesterEmpty
source: No semester selected
fr: Aucun semestre sélectionné

# newSubscriptionPage_reviewStep_stopTitle
source: Pickup Stop
fr: Point de retrait

# newSubscriptionPage_reviewStep_stopName
source: Stop Name
fr: Nom du point de retrait

# newSubscriptionPage_reviewStep_stopEmpty
source: No stop selected
fr: Aucun point de retrait sélectionné

# newSubscriptionPage_reviewStep_weeklyScheduleTitle
source: Weekly Schedule
fr: Horaire hebdomadaire

# newSubscriptionPage_reviewStep_weeklyScheduleDay
source: Day
fr: Jour

# newSubscriptionPage_reviewStep_weeklyScheduleEmpty
source: No schedules added
fr: Aucun horaire ajouté

# newSubscriptionPage_reviewStep_infoBubbleTitle
source: Review Required
fr: Vérification requise

# newSubscriptionPage_reviewStep_infoBubbleDescription
source: Your subscription will be reviewed by our team. You will receive a notification once it has been approved or if any changes are needed.
fr: Votre abonnement sera examiné par notre équipe. Vous recevrez une notification une fois approuvé ou si des modifications sont nécessaires.

# newSubscriptionPage_overlay_title
source: Submitting your subscription...
fr: Envoi de votre abonnement...

# newSubscriptionPage_overlay_subtitle
source: We are securing your seat on the bus...
fr: Nous réservons votre place dans le bus...

# newSubscriptionPage_stopPreview_noLink
source: No map link available for this stop.
fr: Aucun lien vers la carte disponible pour cet arrêt.

# newSubscriptionPage_stopPreview_noImage
source: Image not available
fr: Image non disponible

# newSubscriptionPage_stopPreview_mapsCta
source: View on Google Maps
fr: Voir sur Google Maps

# newSubscriptionPage_stopPreview_noMedia
source: No media
fr: Aucun média

# newStopForm_handleSubmit_success
source: Bus stop created successfully
fr: Arrêt de bus créé avec succès

# newStopForm_handleSubmit_failed
source: Failed to create bus stop
fr: Échec de la création de l'arrêt de bus

# newStopForm_appBar_title
source: New Bus Stop
fr: Nouvel arrêt de bus

# newStopForm_listTile_infoBubble
source: The form below allows you to create a new bus stop. This will be added to the list of available stops for users to select when subscribing to bus routes.
fr: Le formulaire ci-dessous vous permet de créer un nouvel arrêt de bus. Celui-ci sera ajouté à la liste des arrêts disponibles pour les utilisateurs lors de leur inscription aux lignes de bus.

# newStopForm_stopDetails
source: Bus Stop Details
fr: Détails de l'arrêt de bus

# newStopForm_stopDetails_image
source: Upload a capture of the place (optional)
fr: Télécharger une capture d'écran du lieu (facultatif)

# newStopForm_stopDetails_nameLabel
source: Pickup place name *
fr: Nom du lieu de prise en charge *

# newStopForm_stopDetails_nameHint
source: Name of the place
fr: Nom du lieu

# newStopForm_stopDetails_nameValidator
source: Please enter the name of the bus stop
fr: Veuillez saisir le nom de l'arrêt de bus

# newStopForm_stopDetails_mapsLabel
source: Maps URL (optional)
fr: URL de la carte (facultatif)

# newStopForm_stopDetails_mapsHint
source: A Google maps link to the place
fr: Lien Google Maps vers le lieu

# newStopForm_stopDetails_mapsValidator
source: Please enter a valid Google Maps link
fr: Veuillez saisir un lien Google Maps valide

# newStopForm_handleSubmit_label
source: Add stop
fr: Ajouter l'arrêt

# newStopForm_handleSubmit_labelLoading
source: Adding...
fr: Ajout en cours...

# editStopForm_handleSubmit_success
source: Bus stop updated successfully
fr: Arrêt de bus mis à jour avec succès

# editStopForm_handleSubmit_failed
source: Failed to update bus stop
fr: Échec de la mise à jour de l'arrêt de bus

# editStopForm_appBar_title
source: Edit Bus Stop
fr: Modifier l'arrêt de bus

# editStopForm_notFound
source: Bus stop not found
fr: Arrêt de bus introuvable

# editStopForm_notFound_ctaLabel
source: Go Back
fr: Retour

# editStopForm_listTile_infoBubble
source: Update the information for this bus stop. Changes will be reflected for all users who have subscribed to this stop.
fr: Mise à jour des informations de cet arrêt de bus. Les modifications seront visibles pour tous les utilisateurs abonnés à cet arrêt.

# editStopForm_metaData
source: Metadata
fr: Métadonnées

# editStopForm_handleSubmit_labelLoading
source: Updating...
fr: Mise à jour en cours...

# editStopForm_handleSubmit_label
source: Update stop
fr: Mise à jour de l'arrêt

# semesterFormPage_selectYear_null
source: Please select a year first
fr: Veuillez d'abord sélectionner une année

# semesterFormPage_selectSemester_null
source: Please select a semester first
fr: Veuillez d'abord sélectionner un semestre

# semesterFormPage_pickedDate_null
source: Start date must be in
fr: La date de début doit être comprise entre

# semesterFormPage_validateDate
source: End date must be in {selectedYear1} or {selectedYear2}
fr: La date de fin doit être comprise entre {selectedYear1} et {selectedYear2}

# semesterFormPage_handleSubmit_yearNull
source: Please select a year
fr: Veuillez sélectionner une année

# semesterFormPage_handleSubmit_semesterNull
source: Please select a semester
fr: Veuillez sélectionner un semestre

# semesterFormPage_handleSubmit_datesNull
source: Please select start and end dates
fr: Veuillez sélectionner les dates de début et de fin

# semesterFormPage_handleSubmit_startIsAfter
source: Start date must be before end date
fr: La date de début doit être antérieure à la date de fin

# semesterFormPage_handleSubmit_semesterDurationDays
source: Semester must be at least 30 days long
fr: Le semestre doit durer au moins 30 jours

# semesterFormPage_handleSubmit_semesterDurationMonths
source: Semester cannot be longer than 6 months
fr: Le semestre ne peut pas durer plus de 6 mois
