Repository: Joel-Fah/busin
Catalog: lib/l10n/app_*.arb
Languages: fr

# language_english
source: English
fr: Anglais

# language_french
source: French
fr: Français

# weekday_monday
source: Monday
fr: Lundi

# weekday_tuesday
source: Tuesday
fr: Mardi

# weekday_wednesday
source: Wednesday
fr: Mercredi

# weekday_thursday
source: Thursday
fr: Jeudi

# weekday_friday
source: Friday
fr: Vendredi

# weekday_saturday
source: Saturday
fr: Samedi

# weekday_sunday
source: Sunday
fr: Dimanche

# locale_popup_btn_tooltip
source: Change Language
fr: Changez la langue

# locale_popup_btn_label
source: Language changed to {locale}
fr: Langue changée en {locale}

# backButton
source: Back
fr: Retour

# continueButton
source: Continue
fr: Continuer

source: Status
fr: Statut

source: Status: Pending
fr: Statut : En attente

source: Status: Approved
fr: Statut : Approuvé

source: Status: Rejected
fr: Statut : Rejeté

# roleStudent
source: Student
fr: Etudiant

# accountPending
source: Pending
fr: En attente

# accountVerified
source: Verified
fr: Verifié

# accountSuspended
source: Suspended
fr: Suspendu

source: Subscriptions
fr: Abonnements

# subscriptionPending
source: Pending
fr: En attente

# subscriptionApproved
source: Approved
fr: Accepté

# subscriptionRejected
source: Rejected
fr: Rejeté

# subscriptionExpired
source: Expired
fr: Expiré

source: Scannings
fr: Scans

source: Joined
fr: Rejoint

source: Last sign in
fr: Dernière connexion

source: Last updated
fr: Dernière mise à jour

source: Start
fr: Début

source: End
fr: Fin

source: Cancel
fr: Annuler

source: Edit
fr: Modifier

source: Delete
fr: Supprimer

source: Refresh
fr: Rafraîchir

source: Retry
fr: Réessayer

source: Yes
fr: Oui

source: No
fr: Non

source: Created at
fr: Créé le

source: Updated at
fr: Modifié le

source: Map
fr: Carte

# unknown
source: Unknown user
fr: Inconnu

source: Loading...
fr: Chargement...

source: By
fr: Par

source: days
fr: jours

# newLabel
source: New
fr: Nouveau

source: View all
fr: Tout voir

source: User Profile
fr: Profil Utilisateur

source: Morning
fr: Matin

source: Closing
fr: Clôture

source: Close
fr: Fermer

source: Download
fr: Télécharger

# allLabel
source: All
fr: Tous

source: Filter
fr: Filtrer

source: Search
fr: Rechercher

source: Year
fr: Année

source: Semester
fr: Semestre

source: Stop
fr: Arrêt

# naLabel
source: N/A
fr: R.A.S

source: week
fr: semaine

source: Monthly
fr: Mensuel

source: Bus Stops
fr: Arrêts de bus

source: Submit
fr: Soumettre

source: Next
fr: Suivant

source: Selected
fr: Sélectionné

source: Remove
fr: Retirer

source: Add
fr: Ajouter

source: Updated by:
fr: Modifié par:

source: user(s)
fr: utilisateur(s)

source: Change
fr: Changer

source: Today
fr: Aujourd'hui

source: Yesterday
fr: Hier

source: Error:
fr: Erreur :

# onboarding_screen1_title
source: Staring at the clock, waiting for the bus to leave, knowing I'll be up early tomorrow — becomes difficult to sleep with endless school work piling up too ... frrrrrrrr
fr: Regarder l'horloge en attendant le départ du bus, sachant que je devrai me lever tôt demain... Difficile de dormir avec tous ces devoirs qui s'accumulent… pffffffff

# onboarding_screen1_subtitle
source: Na, e go pay off one day, sha.
fr: Ça finira par payer un jour.

# onboarding_screen2_title
source: Wanna live and contribute to a better bus experience as from now on?
fr: Envie de vivre et de contribuer à une meilleure expérience de bus à partir de maintenant ?

# onboarding_screen2_subtitle
source: Hesitate no more...
fr: N'hésitez plus...

# onboarding_cta
source: Get Started
fr: Commencer

# authModal_Step1_title
source: You're coming as a:
fr: Vous êtes un :

# authModal_Step1_subtitle
source: Select the profile that best fits you below
fr: Sélectionnez le profil qui vous correspond le mieux ci-dessous

# authModal_Step1_option1
source: Student
fr: Étudiant

# authModal_Step1_cta1Proceed
source: Proceed to Authentication
fr: Procéder à l'authentification

# authModal_Step1_cta2Skip
source: Just skip for now
fr: Ignorer pour le moment

# authModal_Step2_subtitle
source: Authentication happening within
fr: Authentification effectuée au sein de

# authModal_Step2_title
source: The ICT University Organization
fr: L'organisation, The ICT University

# authModal_Step2_instruction_slice1
source: You can authenticate with your
fr: Vous pouvez vous authentifier avec votre compte Google :

# authModal_Step2_instruction_details
source: This means that only students and school admins having a valid access to their personal google account provided by The ICT University organization can log into BusIn.
fr: Cela signifie que seuls les étudiants et les administrateurs de l'établissement disposant d'un accès valide à Leur compte Google personnel fourni par l'organisation ICT University peut se connecter à BusIn.

# authModal_Step2_instruction_detailsBullet1
source: This helps us keep tract of our students’ data internally.
fr: Cela nous permet de suivre les données de nos étudiants en interne.

# authModal_Step2_instruction_detailsBullet2
source: Makes the authentication process friendly and quite easier for you.
fr: Rend le processus d'authentification plus convivial et plus simple pour vous.

# authModal_Step2_cta1Back
source: Back
fr: Retour

# authModal_Step2_cta2Login
source: Login with Google
fr: Se connecter avec Google

# anonymousPage_appBar_title
source: Anonymous User
fr: Utilisateur Anonyme

# anonymousPage_appBar_subtitle
source: sign in now
fr: connexion

# anonymousPage_warningAlert
source: You're not authenticated
fr: Vous n'êtes pas authentifié

# anonymousPage_headline
source: There’s surely a seat available for you
fr: Il y a sûrement une place de libre pour vous

# anonymousPage_listTitle
source: What does BusIn has to offer?
fr: Qu'est-ce que BusIn a à offrir ?

# anonymousPage_list_option1Title
source: BusIn for students
fr: BusIn pour les étudiants

# anonymousPage_list_option1Subtitle
source: Discover how BusIn improves students' engagement
fr: Découvrez comment BusIn améliore l'engagement des étudiants

# anonymousPage_list_option2Title
source: BusIn for administrators
fr: BusIn pour les administrateurs

# anonymousPage_list_option2Subtitle
source: Learn how BusIn serves the school administration
fr: Apprenez comment BusIn se met au service de l'administration

# authModal_initialPage_title
source: Welcome to BusIn
fr: Bienvenue sur BusIn

# authModal_initialPage_subtitle
source: Your smart bus subscription manager
fr: Votre gestionnaire intelligent d'abonnement de bus

# authModal_initialPage_question
source: Already have an account?
fr: Vous avez déjà un compte ?

# authModal_actions_login
source: Login with Google
fr: Se connecter avec Google

# authModal_actions_signup
source: New here? Sign Up
fr: Nouveau ici ? S'inscrire

# authModal_actions_skip
source: Skip for now
fr: Ignorer pour le moment

# authModal_loginStep_title
source: Welcome back!
fr: Bon retour parmi nous !

# authModal_loginStep_subtitle
source: We're happy to see you again. Sign in to access your account
fr: Nous sommes ravis de vous revoir. Connectez-vous pour continuer.

# authModal_loginStep_info
source: Use your ICT University email (@ictuniversity.edu.cm) to sign in
fr: Utilisez votre addresse email (@ictuniversity.ed.cm) pour vous connecter en toute sécurité.

# authModal_loginStep_ctaLogin
source: Sign in with Google
fr: Se connecter avec Google

# authModal_loginStep_ctaLoginLoading
source: Signing in...
fr: Connexion ...

# authModal_signupStep_ctaSignup
source: Sign up with Google
fr: S'inscrire avec Google

# authModal_signupStep_ctaSignupLoading
source: Creating account...
fr: Inscription ...

# verificationPage_titlePending
source: Pending Verification
fr: Vérification en cours

# verificationPage_titleRejected
source: Verification Rejected
fr: Vérification refusée

# verificationPage_titleComplete
source: Verification Complete
fr: Vérification terminée

# verificationPage_descriptionRejected
source: Your staff account request has been declined by an administrator. Please contact support for more information.
fr: Votre demande de compte a été refusée par un administrateur. Veuillez contacter l'assistance pour plus d'informations.

# verificationPage_descriptionPending
source: Your staff account is awaiting admin approval. You will be notified once your account has been verified.
fr: Votre compte est en attente de validation. Vous serez averti(e) dès qu'il sera validé.

# verificationPage_descriptionComplete
source: Your account has been verified! You can now access the application.
fr: Votre compte a été validé ! Vous pouvez maintenant accéder à l'application.

# verificationPage_infoAlert_descriptionRejected
source: Your request was not approved. You can try again by creating a new account or contact an administrator for assistance.
fr: Votre demande n'a pas été approuvée. Vous pouvez réessayer en créant un nouveau compte ou en contactant un administrateur.

# verificationPage_infoAlert_descriptionVerified
source: Your account is ready! Click below to access the application.
fr: Votre compte est prêt ! Cliquez ci-dessous pour accéder à l'application.

# verificationPage_infoAlert_descriptionPending
source: An admin will review your account shortly. This usually takes less than 24 hours.
fr: Un administrateur examinera votre compte prochainement. Cela prend généralement moins de 24 heures.

# verificationPage_ctaVerified
source: Continue to App
fr: Continuer vers l'application

# verificationPage_ctaPending
source: Check Status
fr: Vérifier le statut

# verificationPage_ctaPendingLoading
source: Checking...
fr: Vérification en cours...

# verificationPage_ctaSignOut
source: Sign Out
fr: Déconnexion

# verificationPage_labelSupport
source: Need help? Contact an administrator.
fr: Besoin d'aide ? Contactez un administrateur.

# verificationPage_rejectMessage
source: Your account has been rejected.
fr: Votre compte a été refusé.

# verificationPage_checkStatusError
source: Error checking status:
fr: Erreur lors de la vérification du statut :

# verificationPage_approvedMessage
source: Account verified! You now have staff access.
fr: Compte vérifié ! Vous disposez désormais d'un accès administrateur.

# verificationPage_navigationError
source: Error navigating:
fr: Erreur de navigation :

# verificationPage_signOutMessage
source: Signed out successfully.
fr: Déconnexion réussie.

# welcomeModal_titleStudent
source: Welcome to BusIn!
fr: Bienvenue sur BusIn !

# welcomeModal_messageStudent
source: Hey there! We're excited to have you on board. Managing your bus subscriptions ath the ICT University just got way easier. Ready to hop on?
fr: Salut ! Nous sommes ravis de vous accueillir. La gestion de vos abonnements de bus à ICT University est désormais beaucoup plus simple. Prêt à monter à bord ?

# welcomeModal_ctaStudent
source: Let's Explore!
fr: Allons-y !

# welcomeModal_titleStaff
source: Welcome to BusIn Staff Portal
fr: Bienvenue sur le portail BusIn pour le personnel

# welcomeModal_messageStaff
source: Thank you for joining the BusIn team. You now have access to scan student QR codes and verify bus access. Let's make transportation management seamless at the ICT University.
fr: Merci de rejoindre l'équipe BusIn. Vous pouvez désormais scanner les codes QR étudiants et vérifier l'accès aux bus. Simplifions la gestion des transports à ICT University.

# welcomeModal_ctaStaff
source: Get Started
fr: Commencer

# welcomeModal_titleAdmin
source: Welcome to BusIn Admin Panel
fr: Bienvenue sur le panneau d'administration BusIn

# welcomeModal_messageAdmin
source: Welcome to the BusIn management dashboard. You have full access to manage subscriptions, bus stops, semesters, and oversee the entire transportation system. Let's streamline operations for the ICT University.
fr: Bienvenue sur le tableau de bord de gestion BusIn. Vous avez un accès complet pour gérer les abonnements, les arrêts de bus, semestres, et superviser l'ensemble du système de transport. Rationalisons les opérations de ICT University.

# welcomeModal_ctaAdmin
source: Access Dashboard
fr: Accéder au tableau de bord

# homeNav_analyticsTab
source: Analytics
fr: Analyses

# homeNav_studentHomeTab
source: Home
fr: Accueil

# homeNav_subscriptionsTab
source: Subscriptions
fr: Abonnements

# homeNav_scanningsTab
source: Scannings
fr: Scans

# homeNav_peopleTab
source: People
fr: Personnes

# profilePage_appBar_title
source: Profile
fr: Profil

# profilePage_subHeading_yourData
source: Your data on BusIn
fr: Vos données sur BusIn

# profilePage_listTile_accountInfo
source: Account Info
fr: Information du Compte

# profilePage_accountInfo_subtitle
source: Complete your profile information
fr: Complétez votre profil

# profilePage_accountInfo_badge
source: Action required
fr: Action requise

# profilePage_listTile_appearance
source: Appearance
fr: Apparences

# profilePage_listTile_legal
source: Legal
fr: Légal

# profilePage_subHeading_busManagement
source: Bus Management
fr: Gestion des bus

# profilePage_listTile_busStops
source: Bus Stops
fr: Arrêts de bus

# profilePage_busStops_subtitle
source: Manage places where the bus picks up students
fr: Gérer les lieux de prise en charge des élèves par le bus

# profilePage_listTile_semesters
source: Semesters
fr: Semestres

# profilePage_semesters_subtitle
source: Manage bus semesters duration and more
fr: Gérer la durée des semestres de bus et plus encore

# profilePage_listTile_signOut
source: Sign out
fr: Se déconnecter

# profilePage_listTile_signOutMessage
source: Signed out successfully
fr: Déconnexion réussie

# signOut_confirmTitle
source: Sign Out?
fr: Se déconnecter ?

# signOut_confirmMessage
source: Are you sure you want to sign out? You can always sign back in.
fr: Êtes-vous sûr de vouloir vous déconnecter ? Vous pouvez toujours vous reconnecter.

# signOut_confirmButton
source: Sign Out
fr: Se déconnecter

# signOut_cancelButton
source: Cancel
fr: Annuler

# signOut_dontShowAgain
source: Don't ask me again
fr: Ne plus me demander

# profilePage_appInfo_rights
source: All rights reserved
fr: Tous droits réservés

# loadingPage_label
source: Loading your journey...
fr: Chargement de votre aventure...

# accountInfoPage_missingLabel
source: Missing:
fr: Manquant :

# accountInfoPage_sectionHeader_google
source: Google Account Information
fr: Informations du compte Google

# accountInfoPage_googleSection_provider
source: Provider
fr: Fournisseur

# accountInfoPage_googleSection_displayName
source: Display Name
fr: Nom d'affichage

# accountInfoPage_googleSection_displayNameWarning
source: No display name set. Using email username as fallback. Update your Google account to set a display name.
fr: Aucun nom d'affichage défini. Utilisation du nom d'utilisateur de l'adresse e-mail par défaut. Mettez à jour votre compte Google pour définir un nom d'affichage.

# accountInfoPage_googleSection_email
source: Email address
fr: Adresse e-mail

# accountInfoPage_googleSection_accountStatus
source: Account status
fr: Statut du compte

# accountInfoPage_sectionHeader_contact
source: Contact Information
fr: Informations de contact

# accountInfoPage_sectionHeader_update
source: Update Your Information
fr: Mettre à jour vos informations

# accountInfoPage_editableField_phoneNumber
source: Phone Number
fr: Numéro de téléphone

# accountInfoPage_editableField_gender
source: Gender
fr: Sexe

# accountInfoPage_editableField_genderNotSpecified
source: Not specified
fr: Non spécifié

# accountInfoPage_sectionHeader_studentInfo
source: Student Information
fr: Informations sur l'étudiant

# accountInfoPage_sectionHeader_studentDetails
source: Student Details
fr: Détails de l'étudiant

# accountInfoPage_editableField_studentID
source: Student ID (Matricule)
fr: Numéro d'étudiant (matricule)

# accountInfoPage_editableField_department
source: Department
fr: Département

# accountInfoPage_editableField_departmentNotProvided
source: Not provided
fr: Non renseigné

# accountInfoPage_editableField_program
source: Program (Major)
fr: Programme (spécialisation)

# accountInfoPage_editableField_programInstruction
source: Please select a department first
fr: Veuillez d'abord sélectionner un département

# accountInfoPage_editableField_streetAddress
source: Street Address
fr: Rue/Quartier

# accountInfoPage_editableField_streetAddressHint
source: Enter your street address
fr: Renseignez votre quartier ou rue

# accountInfoPage_editableField_programNotProvided
source: Not provided
fr: Non renseigné

# accountInfoPage_updateSuccessful
source: Account information updated successfully
fr: Informations du compte mises à jour avec succès

# accountInfoPage_updateFailed
source: Failed to update:
fr: Échec de la mise à jour :

# accountInfoPage_ctaSaveChanges
source: Save Changes
fr: Enregistrer les modifications

# accountInfoPage_ctaSaveChangesLoading
source: Saving...
fr: Enregistrement...

# accountInfoPage_roleBadge_labelStudent
source: Student Account
fr: Compte étudiant

# accountInfoPage_roleBadge_descriptionStudent
source: Make subscriptions to the bus service and make the most out of BusIn.'
fr: Souscrivez à un abonnement de bus et profitez pleinement de BusIn.

# accountInfoPage_roleBadge_labelStaff
source: Staff Member
fr: Membre du Staff

# accountInfoPage_roleBadge_descriptionStaff
source: Manage bus services and assist students with their transportation needs.
fr: Gérez les services de bus et aidez les étudiants à répondre à leurs besoins en matière de transport.

# accountInfoPage_roleBadge_labelAdmin
source: Administrator
fr: Administrateur

# accountInfoPage_roleBadge_descriptionAdmin
source: Oversee the entire bus management system and ensure smooth operations.
fr: Supervisez l'ensemble du système de gestion des bus et assurez son bon fonctionnement.

# accountInfoPage_editableField_errorRequired
source: {field} is required
fr: {field} est obligatoire

# appearance_appBar_title
source: Appearance
fr: Apparence

# appearance_listTile_theme
source: Theme
fr: Thème

# appearance_listTile_language
source: Language
fr: Langue

# appearance_listTile_themeSystem
source: System
fr: Système

# appearance_listTile_themeSystemSubtitle
source: Automatically adjust to system settings
fr: S'adapte automatiquement aux paramètres système

# appearance_listTile_themeLight
source: Bright
fr: Lumineux

# appearance_listTile_themeLightSubtitle
source: Sets the app’s theme to light with brighter colors. Suitable for daytime.
fr: Définit le thème de l'application sur clair avec des couleurs plus vives. Convient pour la journée.

# appearance_listTile_themeDark
source: Dimmed
fr: Sombre

# appearance_listTile_themeDarkSubtitle
source: Sets the app’s theme to dark with darker colors. Easy on the eyes in low light
fr: Définit le thème de l'application sur sombre avec des couleurs plus sombres. Confortable pour les yeux en faible luminosité

# appearance_listTile_selected
source: Selected
fr: Sélectionné

# legalPage_appBar_title
source: Legal Information
fr: Informations légales

# legalPage_loadingInfo
source: Loading legal information...
fr: Chargement des informations légales...

# legalPage_offlineContent
source: Using offline content
fr: Utilisation du contenu hors ligne

# legalPage_loadingError
source: Could not load the latest legal information. Showing cached version.
fr: Impossible de charger les informations légales les plus récentes. Affichage de la version en cache.

# stopsPage_appBar_title
source: Stops
fr: Arrêts

# stopsPage_appBar_actionsNew
source: New stop
fr: Nouvel arrêt

# stopsPage_appBar_searchHint
source: Filter bus stops...
fr: Filtrer les arrêts de bus...

# stopsPage_statItem_total
source: Total stops
fr: Arrêts totaux

# stopsPage_statItem_withImages
source: With images
fr: Avec images

# stopsPage_statItem_withMaps
source: With maps
fr: Avec cartes

# stopsPage_loadingError
source: Error loading bus stops
fr: Erreur lors du chargement des arrêts de bus

# stopsPage_emptyListMessageTitle
source: No bus stops yet
fr: Aucun arrêt de bus pour le moment

# stopsPage_emptyQueryMessageTitle
source: No bus stops found
fr: Aucun arrêt de bus trouvé

# stopsPage_emptyListMessageSubtitle
source: Add your first bus stop
fr: Ajoutez votre premier arrêt de bus

# stopsPage_emptyQueryMessageSubtitle
source: Try a different search query
fr: Essayez une autre requête de recherche

# stopsPage_stopCard_deleteModalTitle
source: Delete Bus Stop
fr: Supprimer l'arrêt de bus

# stopsPage_stopCard_deleteModalMessage
source: This action cannot be undone
fr: Cette action est irréversible

# stopsPage_stopCard_deleteModalWarning
source: All data associated with this stop will be permanently deleted.
fr: Toutes les données associées à cet arrêt seront définitivement supprimées.

# stopsPage_stopCard_deleteSuccess
source: Bus stop "{stop}" removed successfully
fr: Arrêt de bus «{stop}» supprimé avec succès.

# stopsPage_stopCard_deleteError
source: Failed to delete bus stop
fr: Échec de la suppression de l'arrêt de bus

# stopsPage_stopCard_imageUnavailable
source: Image not available
fr: Image indisponible

# stopsPage_stopCard_noPreview
source: No preview available
fr: Aucun aperçu disponible

# semestersPage_appBar_title
source: Semesters
fr: Semestres

# semestersPage_appBar_actionsAdd
source: Add semester
fr: Ajouter un semestre

# semestersPage_appBar_activeSemester
source: Active semester
fr: Semestre actif

# semestersPage_infoBubble
source: Define start and end dates for each semester. These dates will be used for subscription validity periods.
fr: Définissez les dates de début et de fin de chaque semestre. Ces dates seront utilisées pour les périodes de validité de l'abonnement.

# semestersPage_statItem_upcoming
source: Upcoming
fr: À venir

# semestersPage_loadingError
source: Error loading semesters
fr: Erreur lors du chargement des semestres

# semestersPage_emptyList_title
source: No semesters configured
fr: Aucun semestre configuré

# semestersPage_emptyList_subtitle
source: Add your first semester to get started
fr: Ajoutez votre premier semestre pour commencer

# semestersPage_handleDelete_successful
source: Semester deleted successfully
fr: Semestre supprimé avec succès

# semestersPage_handleDelete_failed
source: Failed to delete semester
fr: Échec de la suppression du semestre

# semestersPage_handleDelete_title
source: Delete Semester
fr: Supprimer le semestre

# semestersPage_handleDelete_subtitle
source: This action cannot be undone
fr: Cette action est irréversible

# semestersPage_detailRow_startDate
source: Start date
fr: Date de début

# semestersPage_detailRow_endDate
source: End date
fr: Date de fin

# semestersPage_detailRow_duration
source: Duration
fr: Durée

# semestersPage_detailRow_statusActive
source: Active
fr: Actif

# semestersPage_detailRow_statusEnded
source: Ended
fr: Terminé

# semestersPage_detailRow_statusUpcoming
source: Upcoming
fr: À venir

# semestersPage_deleteModal_warning
source: All data associated with this semester will be permanently deleted.
fr: Toutes les données associées à ce semestre seront définitivement supprimées.

# homeTab_title
source: Recent Activity
fr: Activité récente

# homeTab_subscriptionTile_start
source: Start:
fr: Début :

# homeTab_subscriptionTile_end
source: End:
fr: Fin :

# homeTab_emptySubscriptionCard_title
source: No subscriptions yet
fr: Aucun abonnement pour le moment

# homeTab_emptySubscriptionCard_message
source: Create your first bus subscription to see it here.
fr: Créez votre premier abonnement de bus pour le voir ici.

# homeTab_scanningsTile_on
source: On:
fr: Le :

# homeTab_scanningsTile_titleUnavailable
source: Location unavailable
fr: Emplacement indisponbile

# homeTab_emptyScanningsCard_title
source: No scans yet
fr: Aucun scan pour le moment

# homeTab_emptyScanningsCard_message
source: Your QR code hasn't been scanned yet.
fr: Votre code QR n'a pas encore été scanné.
