Repository: Joel-Fah/busin
Catalog: lib/l10n/app_*.arb
Languages: fr

# semesterFormPage_handleSubmit_successCreated
source: Semester created successfully
fr: Semestre créé avec succès

# semesterFormPage_handleSubmit_successUpdated
source: Semester updated successfully
fr: Semestre mis à jour avec succès

# semesterFormPage_handleSubmit_failedCreated
source: Failed to create semester
fr: Échec de la création du semestre

# semesterFormPage_handleSubmit_failedUpdated
source: Failed to update semester
fr: Échec de la mise à jour du semestre

# semesterFormPage_appBar_titleCreate
source: Add Semester
fr: Ajouter un semestre

# semesterFormPage_appBar_titleEdit
source: Edit Semester
fr: Modifier un semestre

# semesterFormPage_infoBanner_update
source: Update the date range for this semester. Changes will affect all subscriptions using these dates.
fr: Mettez à jour la plage de dates pour ce semestre. Les modifications affecteront tous les abonnements utilisant ces dates.

# semesterFormPage_infoBanner_create
source: Define the start and end dates for a semester. These dates will be used for subscription validity periods.
fr: Définissez les dates de début et de fin d'un semestre. Ces dates seront utilisées pour les périodes de validité des abonnements.

# semesterFormPage_sectionHeader_semesterDetails
source: Semester Details
fr: Détails du semestre

# semesterFormPage_semesterDetails_type
source: Semester Type
fr: Type de semestre

# semesterFormPage_semesterDetails_semesterSelected
source: is already registered for
fr: est déjà enregistré pour

# semesterFormPage_sectionHeader_dateRange
source: Date Range
fr: Plage de dates

# semesterFormPage_dateRange_startDate
source: Start Date
fr: Date de début

# semesterFormPage_dateRange_startDateHint
source: Select start date
fr: Sélectionnez la date de début

# semesterFormPage_dateRange_endDate
source: End Date
fr: Date de fin

# semesterFormPage_dateRange_endDateHint
source: Select end date
fr: Sélectionnez la date de fin

# semesterFormPage_sectionHeader_durationPreview
source: Duration
fr: Durée

# semesterFormPage_submit_update
source: Update Semester
fr: Mettre à jour le semestre

# semesterFormPage_submit_create
source: Add Semester
fr: Ajouter le semestre

# imageBox_sizeLimit
source: The image size should not be more than
fr: La taille de l'image ne doit pas dépasser

# imageBox_uploadError
source: Error during image upload:
fr: Erreur lors du chargement de l'image :

# imageBox_loadingError
source: Loading error
fr: Erreur de chargement

# peopleTab_emptySearchState_title
source: No results found
fr: Aucun résultat trouvé

# peopleTab_emptySearchState_subtitle
source: Try adjusting your search
fr: Veuillez ajuster votre recherche

# peopleTab_handlePromote_onlyAdmin
source: Only admins can promote/demote staff members
fr: Seuls les administrateurs peuvent promouvoir/rétrograder les membres du personnel

# peopleTab_handlePromote_successPromote
source: has been promoted to Admin
fr: a été promu administrateur

# peopleTab_handlePromote_successDemote
source: has been demoted to Staff
fr: a été rétrogradé en membre du personnel

# peopleTab_promoteModal_titlePromote
source: Promote to Admin
fr: Promouvoir administrateur

# peopleTab_promoteModal_titleDemote
source: Demote to Staff
fr: Rétrograder membre du personnel

# peopleTab_promoteModal_infoWarningTitle
source: Important Information
fr: Information importante

# peopleTab_promoteModal_infoWarningSubtitlePromote
source: This user will gain full administrative access:
fr: Cet utilisateur bénéficiera d'un accès administrateur complet :

# peopleTab_promoteModal_infoWarningSubtitleDemote
source: This user will lose administrative access:
fr: Cet utilisateur perdra ses droits d'administrateur :

# peopleTab_promoteModal_ctaPromote
source: Promote
fr: Promouvoir

# peopleTab_promoteModal_ctaDemote
source: Demote
fr: Rétrograder

# peopleTab_accessList_promote1
source: Manage all subscriptions
fr: Gérer tous les abonnements

# peopleTab_accessList_promote2
source: Approve/Reject staff members
fr: Approuver/Refuser les membres du personnel

# peopleTab_accessList_promote3
source: Promote/Demote staff members
fr: Promouvoir/Rétrograder les membres du personnel

# peopleTab_accessList_promote4
source: Manage semesters and bus stops
fr: Gérer les semestres et les arrêts de bus

# peopleTab_accessList_promote5
source: View all analytics
fr: Consulter toutes les analyses

# peopleTab_accessList_promote6
source: Full system access
fr: Accès complet au système

# peopleTab_accessList_demote1
source: Can only verify subscriptions
fr: Vérifier uniquement les abonnements

# peopleTab_accessList_demote2
source: Cannot approve staff members
fr: Impossible d'approuver les membres du personnel

# peopleTab_accessList_demote3
source: Cannot promote/demote users
fr: Impossible de promouvoir/rétrograder les utilisateurs

# peopleTab_accessList_demote4
source: Limited management access
fr: Accès à la gestion limité

# peopleTab_accessList_demote5
source: Restricted analytics view
fr: Affichage restreint des analyses

# homeNav_updatesTab
source: Updates
fr: Actus

# checkInSheet_title
source: Today's Boarding List
fr: Liste d'embarquement du jour

# checkInSheet_subtitle
source: {count} student(s) checked in
fr: {count} étudiant(s) pointé(s)

# checkInSheet_searchHint
source: Search student...
fr: Rechercher un étudiant...

# checkInSheet_emptyTitle
source: No check-ins yet
fr: Aucun pointage encore

# checkInSheet_emptySubtitle
source: Scan student QR codes to start
fr: Scannez les codes QR des étudiants pour commencer

# checkInSheet_noMatch
source: No matching students
fr: Aucun étudiant correspondant

# checkInSheet_allTab
source: All
fr: Tous

# checkInSheet_morningTab
source: Morning
fr: Matin

# checkInSheet_closingTab
source: Closing
fr: Soir

# updatesTab_earlierToday
source: Earlier today
fr: Plus tôt aujourd'hui

# updatesTab_emptyState
source: No updates yet today. Be the first to share one!
fr: Aucune mise à jour aujourd'hui. Soyez le premier à en partager une !

# updatesTab_genericHint
source: Send an update to your mates...
fr: Envoyez une mise à jour à vos camarades...

# updatesTab_notSubscribed
source: You need an active subscription to send updates
fr: Vous devez avoir un abonnement actif pour envoyer des mises à jour

# updatesTab_needScanForLocation
source: You must board the bus (scan QR) before sharing location
fr: Vous devez embarquer le bus (scanner le QR) avant de partager la localisation

# peopleTab_subscriptionCount
source: {count} sub(s)
fr: {count} abo(s)

# scanner_checkInListTooltip
source: Boarding List
fr: Liste d'embarquement

# scanner_cameraPermissionDenied
source: Camera permission denied
fr: Permission de la caméra refusée

# scanner_cameraPermissionMessage
source: Camera access is required to scan QR codes. Please allow camera access in your device settings.
fr: L'accès à la caméra est requis pour scanner les codes QR. Veuillez autoriser l'accès dans les paramètres de votre appareil.

# scanner_openSettings
source: Open Settings
fr: Ouvrir les paramètres

# scanner_maxScansReached
source: This student has already been scanned twice today
fr: Cet étudiant a déjà été scanné deux fois aujourd'hui

# profilePage_listTile_myReports
source: My Reports
fr: Mes signalements

# profilePage_listTile_studentReports
source: Student Reports
fr: Signalements étudiants

# profilePage_studentReports_subtitle
source: View and resolve student complaints
fr: Consulter et résoudre les plaintes des étudiants

# profilePage_pendingBadge
source: pending
fr: en attente

# profilePage_listTile_checkInHistory
source: Check-in History
fr: Historique des pointages

# profilePage_checkInHistory_subtitle
source: View daily attendance trends & records
fr: Voir les tendances d'assiduité et les enregistrements quotidiens

# reportsPage_title
source: My Reports
fr: Mes signalements

# reportsPage_newReport
source: New Report
fr: Nouveau signalement

# reportsPage_emptyTitle
source: No reports yet
fr: Aucun signalement

# reportsPage_emptySubtitle
source: Submit a report to share your concerns about the bus service.
fr: Soumettez un signalement pour partager vos préoccupations concernant le service de bus.

# reportsPage_adminResponse
source: Admin Response
fr: Réponse de l'admin

# reportSheet_title
source: Submit a Report
fr: Soumettre un signalement

# reportSheet_subtitle
source: Tell us about any concern regarding the bus service.
fr: Dites-nous toute préoccupation concernant le service de bus.

# reportSheet_subject
source: Subject
fr: Sujet

# reportSheet_customSubjectHint
source: Custom subject title...
fr: Titre du sujet personnalisé...

# reportSheet_priority
source: Priority: {priority}
fr: Priorité : {priority}

# reportsAdminPage_title
source: Student Reports
fr: Signalements étudiants

# reportsAdmin_tabPending
source: Pending
fr: En attente

# reportsAdmin_tabInReview
source: In Review
fr: En examen

# reportsAdmin_tabResolved
source: Resolved
fr: Résolus

# reportsAdmin_emptyPending
source: No pending reports
fr: Aucun signalement en attente

# reportsAdmin_emptyInReview
source: No reports in review
fr: Aucun signalement en examen

# reportsAdmin_emptyResolved
source: No resolved reports
fr: Aucun signalement résolu

# reportsAdmin_response
source: Response
fr: Réponse

# reportsAdmin_review
source: Review
fr: Examiner

# reportsAdmin_resolve
source: Resolve
fr: Résoudre

# reportsAdmin_resolveTitle
source: Resolve Report
fr: Résoudre le signalement

# reportsAdmin_responseHint
source: Add a response for the student (optional)...
fr: Ajouter une réponse pour l'étudiant (optionnel)...

# reportsAdmin_markResolved
source: Mark as Resolved
fr: Marquer comme résolu

# checkInHistory_title
source: Check-in History
fr: Historique des pointages

# checkInHistory_dailyLists
source: Daily Lists
fr: Listes quotidiennes

# checkInHistory_emptyTitle
source: No check-in history
fr: Aucun historique de pointage

# checkInHistory_emptySubtitle
source: Start scanning students to build attendance records.
fr: Commencez à scanner les étudiants pour construire les fiches de présence.

# checkInHistory_trendTitle
source: Attendance Trend
fr: Tendance de présence

# checkInHistory_trendSubtitle
source: Last {count} days
fr: {count} derniers jours

# checkInHistory_morning
source: Morning
fr: Matin

# checkInHistory_evening
source: Closing
fr: Soir

# checkInHistory_days
source: Days
fr: Jours

# checkInHistory_avgPerDay
source: Avg / Day
fr: Moy / Jour

# checkInHistory_today
source: Today
fr: Aujourd'hui

# checkInHistory_studentCount
source: {count} student(s)
fr: {count} étudiant(s)

# greeting_morning
source: Good morning! ☀️
fr: Bonjour ! ☀️

# greeting_afternoon
source: Good afternoon! 🌤️
fr: Bon après-midi ! 🌤️

# greeting_evening
source: Good evening! 🌙
fr: Bonsoir ! 🌙

# validation_phoneRequired
source: Phone number is required
fr: Le numéro de téléphone est requis

# validation_phoneInvalid
source: Please enter a valid Cameroon phone number
fr: Veuillez entrer un numéro de téléphone camerounais valide

# validation_matriculeRequired
source: Student ID is required
fr: Le matricule est requis

# validation_matriculeLength
source: Student ID must be 12 characters long
fr: Le matricule doit avoir 12 caractères

# validation_matriculePrefix
source: Student ID must start with ICTU
fr: Le matricule doit commencer par ICTU

# validation_matriculeYear
source: Invalid year in Student ID
fr: Année invalide dans le matricule

# validation_matriculeDigits
source: Last 4 characters must be digits
fr: Les 4 derniers caractères doivent être des chiffres

# semesterPage_viewStudents
source: View registered students
fr: Voir les étudiants inscrits

# semesterPage_studentsTitle
source: Registered Students
fr: Étudiants inscrits

# semesterPage_studentsSubtitle
source: {count} student(s) registered
fr: {count} étudiant(s) inscrit(s)

# semesterPage_noStudents
source: No students registered for this semester
fr: Aucun étudiant inscrit pour ce semestre

# semesterPage_searchStudents
source: Search students...
fr: Rechercher des étudiants...
